# 什么是 JSON 字符串？
"""
    JSON(JavaScript Object Notation, JS 对象标记) 是一种轻量级的数据交换格式。它基于
ECMAScript (w3c制定的 js规范)的一个子集，采用完全独立于编程语言的文本格式来存储和表示数据。
简洁和清晰的层次结构使得 JSON 成为理想的数据交换语言。
    易于人阅读和编写，同时也易于机器解析和生成，并有效地提升网络传输效率。
"""
"""
    JSON是一个标记符的序列。这套标记符包含六个构造字符、字符串、数字和三个字面名。
    JSON是一个序列化的对象或数组。

参考： https://baike.baidu.com/item/JSON/2462549?fr=aladdin
"""

# JSON支持数据格式：
#     对象（字典）：   使用花括号。
#     数组（列表）：   使用方括号。
#     字符串类型：    字符串必须要用双引号，不能用单引号。
#     整形、浮点型、布尔类型还有null类型。
#     多个数据之间使用逗号分开。
# 注意：json本质上就是一个字符串。

# json 在线解析工具： https://www.json.cn/
# -------------------------------------------------------------------------------------

