import re

# ---------------------------------------------------------------------------------------
# *：匹配 0个或者多个字符
text_1 = "arbitrarily"
result_1 = re.match('\D*', text_1)  # \d \D \s \S \w \W
print(result_1.group())

# ---------------------------------------------------------------------------------------
# +：匹配 1个或者多个字符
text_2 = "matching"
result_2 = re.match('\w*', text_2)
print(result_2.group())

# ---------------------------------------------------------------------------------------
# ?：匹配前一个字符 0个或者 1个
text_3 = "matching"
result_3 = re.match('\w?', text_3)
print(result_3.group())

# ---------------------------------------------------------------------------------------
# {m}：匹配 m个字符
text_4 = "limited"
result_4 = re.match('\w{2}',text_4)
print(result_4.group())

# ---------------------------------------------------------------------------------------
# {m,n}：匹配 m-n之间的个数的字符
text_5 = "wireless"
result_5 = re.match('\w{1,3}',text_5)
print(result_5.group())