import re

# ---------------------------------------------------------------------------------------
# Python中的转义字符：
# raw  原始,生
text_r = r"hello \n world"
print(text_r)

# ---------------------------------------------------------------------------------------
# 正则表达式中的转义字符：
text_trans = "apple price is $99,range price is $88"
result_trans = re.findall("\$\d+", text_trans)
print(result_trans)

# ---------------------------------------------------------------------------------------
# 原生字符串和正则表达式：
# 正则表达式的字符串解析规则：
# 1. 先把这个字符串放在 Python语言层面进行解析。
# 2. 把 Python语言层面解析的结果,再放到正则表达式层间进行解析。
text = "\cba c"
# result = re.match("\\\\c", text)   # ['\\\\c'] = [(Python语言层面) -> '\\c' ] = [(正则表达式层面) -> '\c']
result = re.match(r"\\c", text)  # ['\\c'] = [(正则表达式层面) -> '\c']
print(result.group())
